/**
 * @module '../data/questions.js'
 * @exports questions
 */
export var questions = [
    {
        abstract: "Тело вопроса",
        type: "checkbox",
        spoiler: [1, 3],
        answers: [
            "Вариант ответа 1*",
            "Вариант ответа 2",
            "Вариант ответа 3*",
            "Вариант ответа 4",
            "Вариант ответа 5"
        ]
    },
    {
        abstract: "Тело вопроса",
        type: "checkbox",
        spoiler: [2, 5],
        answers: [
            "Вариант ответа 1",
            "Вариант ответа 2*",
            "Вариант ответа 3",
            "Вариант ответа 4",
            "Вариант ответа 5*"
        ]
    },
    {
        abstract: "Тело вопроса",
        type: "radio",
        spoiler: [4],
        answers: [
            "Вариант ответа 1",
            "Вариант ответа 2",
            "Вариант ответа 3",
            "Вариант ответа 4*",
            "Вариант ответа 5"
        ]
    },
    {
        abstract: "Тело вопроса",
        type: "checkbox",
        spoiler: [2, 3, 5],
        answers: [
            "Вариант ответа 1",
            "Вариант ответа 2*",
            "Вариант ответа 3*",
            "Вариант ответа 4",
            "Вариант ответа 5*"
        ]
    },
    {
        abstract: "Тело вопроса",
        type: "radio",
        spoiler: [1],
        answers: [
            "Вариант ответа 1*",
            "Вариант ответа 2",
            "Вариант ответа 3",
            "Вариант ответа 4",
            "Вариант ответа 5"
        ]
    }
];


